{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["predictions", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 1], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "GaussianNoise", "name": "gaussian_noise_1", "config": {"name": "gaussian_noise_1", "stddev": 0.3, "trainable": true}}, {"inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_size": [3, 3], "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "axis": -1, "name": "batch_normalization_1", "scale": true, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "axis": -1, "name": "batch_normalization_2", "scale": true, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_size": [3, 3], "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "axis": -1, "name": "batch_normalization_3", "scale": true, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "kernel_size": [3, 3], "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activation": "linear", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "axis": -1, "name": "batch_normalization_4", "scale": true, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "predictions", "config": {"units": 411, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "predictions"}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.8"}