{"config": {"output_layers": [["predictions", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "stddev": 0.3, "name": "gaussian_noise_1"}, "class_name": "GaussianNoise", "name": "gaussian_noise_1"}, {"inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation", "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation", "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation", "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_4", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation", "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_5", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation", "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_6", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_6"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation", "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_7", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_7", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation", "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten"}, "class_name": "Flatten", "name": "flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 4096, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_8", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation", "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 4096, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_9", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation", "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"bias_constraint": null, "name": "predictions", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "units": 411, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "name": "predictions"}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.8"}