{"class_name": "Model", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [64, 64, 1], "trainable": true}}, {"inbound_nodes": [[["reshape_1", 0, 0]]], "name": "gaussiannoise_1", "class_name": "GaussianNoise", "config": {"sigma": 0.1, "name": "gaussiannoise_1", "trainable": true}}, {"inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "same", "b_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_1", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 16, "activity_regularizer": null, "nb_col": 3, "bias": true, "init": "normal", "activation": "linear", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_1", "axis": -3}}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "same", "b_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_2", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 32, "activity_regularizer": null, "nb_col": 3, "bias": true, "init": "normal", "activation": "linear", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_2", "axis": -3}}, {"inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "same", "b_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_3", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 64, "activity_regularizer": null, "nb_col": 3, "bias": true, "init": "normal", "activation": "linear", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_3", "axis": -3}}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0]]], "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"nb_row": 3, "border_mode": "same", "b_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_filter": 128, "activity_regularizer": null, "nb_col": 3, "bias": true, "init": "normal", "activation": "linear", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_4", "axis": -3}}, {"inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0]]], "name": "maxpooling2d_4", "class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_4", "strides": [2, 2], "dim_ordering": "tf"}}, {"inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dropout_4", "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"output_dim": 615, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 2048], "b_regularizer": null, "input_dim": 2048, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "1.2.0"}